#### Loading the Libraries

In [3]:
import pandas as pd
from pathlib import Path

DATASETS_PATH = Path("../../../../datasets/")

#### Loading data from csv file IMDB_Movie_Overview.csv

In [4]:
df_imdb = pd.read_csv(Path(DATASETS_PATH / "IMDB_Movie_Overview.csv"))
df_imdb.head(3)

                                 movie_title   director_name  title_year
0                                    Avatar    James Cameron      2009.0
1  Pirates of the Caribbean: At World's End   Gore Verbinski      2007.0
2                                   Spectre       Sam Mendes      2015.0

#### Show up number of rows and columns

In [5]:
df_imdb.shape

(5043, 3)

#### Show up all columns name

In [6]:
df_imdb.columns

Index(['movie_title', 'director_name', 'title_year'], dtype='object')

#### Show up some row from start
    - default number of row is 5,
    - input number to specify how mamny rows want to show

In [7]:
df_imdb.head(3)

                                 movie_title   director_name  title_year
0                                    Avatar    James Cameron      2009.0
1  Pirates of the Caribbean: At World's End   Gore Verbinski      2007.0
2                                   Spectre       Sam Mendes      2015.0

#### Show up some row from end
    - default will show 5 final rows

In [8]:
df_imdb.tail(3)

                movie_title     director_name  title_year
5040  A Plague So Pleasant   Benjamin Roberds      2013.0
5041      Shanghai Calling        Daniel Hsia      2012.0
5042     My Date with Drew           Jon Gunn      2004.0

#### Show up dataframe summary information
    - have any null and data type on each column

In [9]:
df_imdb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5043 entries, 0 to 5042
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_title    5043 non-null   object
 1   director_name  4939 non-null   object
 2   title_year     4935 non-null   float64
dtypes: float64(1), object(2)
memory usage: 118.3+ KB

#### summary statistic for column which data type is number

In [10]:
df_imdb.describe()

        title_year
count  4935.000000
mean   2002.470517
std      12.474599
min    1916.000000
25%    1999.000000
50%    2005.000000
75%    2011.000000
max    2016.000000